package com.example.a.e.a.azkar;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.support.v7.widget.Toolbar;

import java.util.ArrayList;
import java.util.List;

public class PrayAzkarActivity extends AppCompatActivity {

    Toolbar toolbar;
    AzkaratAdapter adapter;
    RecyclerView recyclerView;
    RecyclerView.LayoutManager layoutManager;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_pray_azkar);

        toolbar = (Toolbar)findViewById(R.id.navi_bar);
        setSupportActionBar(toolbar);

        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        recyclerView = (RecyclerView)findViewById(R.id.recyclerView);

        layoutManager = new LinearLayoutManager(this);
        recyclerView.setLayoutManager(layoutManager);

        adapter = new AzkaratAdapter(getApplicationContext(),getData());
        recyclerView.setAdapter(adapter);



    }

    public List getData(){

        String[] zikr = {
                "أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.\n" +
                        "اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام .",
                "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.",
                "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون. ",
                "سُـبْحانَ الله.",
                " الحَمْـدُ لله.",
                "لله أكْـبَر.",
                "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.",
                "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                        "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. ",
                "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                        "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. ",
                "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                        "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. ",
                "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n" +
                        "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255]",
                "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير. ",
                "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً.",
                "اللَّهُمَّ أَجِرْنِي مِنْ النَّار.",
                "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ."

        };

        String[] fadl = {
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة",
                "فضل الذكر : من أذكار بعد الصلاة"
        };

        String[] repeat = {
                "عدد التكرار : 1",
                "عدد التكرار : 1",
                "عدد التكرار : 1",
                "عدد التكرار : 33",
                "عدد التكرار : 33",
                "عدد التكرار : 33",
                "عدد التكرار : 1",
                "عدد التكرار : 3",
                "عدد التكرار : 3",
                "عدد التكرار : 3",
                "عدد التكرار : 1",
                "عدد التكرار : 10 بَعْدَ المَغْرِب وَالصّـبْح",
                "عدد التكرار : 1 بَعْد السّلامِ من صَلاةِ الفَجْر.",
                "عدد التكرار : 7 بعد صلاة الصبح والمغرب.",
                "عدد التكرار : 1"

        };


        List<AzkarInformation> data = new ArrayList<>();
        for (int i = 0 ; i<zikr.length&&i<fadl.length;i++){
            AzkarInformation current = new AzkarInformation();
            current.zikr=zikr[i];
            current.fadl = fadl[i];
            current.repeat = repeat[i];
            data.add(current);
        }

        return data;

    }
}
